trebisky/stm32f103/usb_baboon/papoon/stm32f103xb_tim.h
// papoon_usb: "Not Insane" USB library for STM32F103xx MCUs
// Copyright (C) 2019,2020 Mark R. Rubin
//
// This file is part of papoon_usb.
//
// The papoon_usb program is free software: you can redistribute it
// and/or modify it under the terms of the GNU General Public License
// as published by the Free Software Foundation, either version 3 of
// the License, or (at your option) any later version.
//
// The papoon_usb program is distributed in the hope that it will be
// useful, but WITHOUT ANY WARRANTY; without even the implied warranty
// of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.	See the GNU
// General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// (LICENSE.txt) along with the papoon_usb program.  If not, see
// <https://www.gnu.org/licenses/gpl.html>


// included multiple times, only from stm32f767.hxx
#ifndef STM32F103XB_TIM_HXX_INCLUDE
#error -- private file, #include stm32f767xx_tim.hxx only from stm32f767.hxx
#else

    volatile Tim*   tim() volatile {
        return reinterpret_cast<volatile Tim*>(this); }
             Tim*   tim()          {
        return reinterpret_cast<         Tim*>(this); }


    struct Cr1 {
        using            pos_t = Pos<uint32_t, Cr1>;
        static constexpr pos_t      CEN_POS      = pos_t( 0),
                                    UDIS_POS     = pos_t( 1),
                                    URS_POS      = pos_t( 2),
                                    OPM_POS      = pos_t( 3),
                                    DIR_POS      = pos_t( 4),
                                    CMS_POS      = pos_t( 5),
                                    ARPE_POS     = pos_t( 7),
                                    CKD_POS      = pos_t( 8),
                                    UIFREMAP_POS = pos_t(11);


        using            bits_t = Bits<uint32_t, Cr1>;
        static constexpr bits_t     CEN      = bits_t(1, CEN_POS            ),
                                    UDIS     = bits_t(1, UDIS_POS           ),
                                    URS      = bits_t(1, URS_POS            ),
                                    OPM      = bits_t(1, OPM_POS            ),
                                    DIR      = bits_t(1, DIR_POS            ),
                                    ARPE     = bits_t(1, ARPE_POS           ),
                                    UIFREMAP = bits_t(1, UIFREMAP_POS       );

        static const uint32_t       CMS_MASK = 0x3,
                                    CKD_MASK = 0x3;

        using            mskd_t = Mskd<uint32_t, Cr1>;
        static constexpr mskd_t CMS_EDGE     = mskd_t(CMS_MASK, 0b00, CMS_POS),
                                CMS_CENTER_1 = mskd_t(CMS_MASK, 0b01, CMS_POS),
                                CMS_CENTER_2 = mskd_t(CMS_MASK, 0b10, CMS_POS),
                                CMS_CENTER_3 = mskd_t(CMS_MASK, 0b11, CMS_POS),
                                CKD_DIV_1    = mskd_t(CKD_MASK, 0b00, CKD_POS),
                                CKD_DIV_2    = mskd_t(CKD_MASK, 0b01, CKD_POS),
                                CKD_DIV_4    = mskd_t(CKD_MASK, 0b10, CKD_POS);
    };  // struct Cr1
    using cr1_t = Reg<uint32_t, Cr1>;
          cr1_t   cr1;

#ifdef STM32F103XB_ADV_TIM_1
    struct Cr2 {
        using              pos_t = Pos<uint32_t, Cr2>;
        static constexpr   pos_t
                CCPC_POS = pos_t( 0),
                CCUS_POS = pos_t( 2),
                CCDS_POS = pos_t( 3),
                 MMS_POS = pos_t( 4),
                TI1S_POS = pos_t( 7),
                OIS1_POS = pos_t( 8),
               OIS1N_POS = pos_t( 9),
                OIS2_POS = pos_t(10),
               OIS2N_POS = pos_t(11),
                OIS3_POS = pos_t(12),
               OIS3N_POS = pos_t(13),
                OIS4_POS = pos_t(14);

        using              bits_t = Bits<uint32_t, Cr2>;
        static constexpr   bits_t
        CCPC             = bits_t(1,         CCPC_POS),
        CCUS             = bits_t(1,         CCUS_POS),
        CCDS             = bits_t(1,         CCDS_POS),
        TI1S             = bits_t(1,         TI1S_POS),
        OIS1             = bits_t(1,         OIS1_POS),
        OIS1N            = bits_t(1,        OIS1N_POS),
        OIS2             = bits_t(1,         OIS2_POS),
        OIS2N            = bits_t(1,        OIS2N_POS),
        OIS3             = bits_t(1,         OIS3_POS),
        OIS3N            = bits_t(1,        OIS3N_POS),
        OIS4             = bits_t(1,         OIS4_POS);

        static const uint32_t
                MMS_MASK =       0x7U;

        using               mskd_t = Mskd<uint32_t, Cr2>;
        static constexpr    mskd_t
        MMS_RESET         = mskd_t( MMS_MASK,   0b000, MMS_POS),
        MMS_ENABLE        = mskd_t( MMS_MASK,   0b001, MMS_POS),
        MMS_UPDATE        = mskd_t( MMS_MASK,   0b010, MMS_POS),
        MMS_COMPARE       = mskd_t( MMS_MASK,   0b011, MMS_POS),
        MMS_OC1REF        = mskd_t( MMS_MASK,   0b100, MMS_POS),
        MMS_OC2REF        = mskd_t( MMS_MASK,   0b101, MMS_POS),
        MMS_OC3REF        = mskd_t( MMS_MASK,   0b110, MMS_POS),
        MMS_OC4REF        = mskd_t( MMS_MASK,   0b111, MMS_POS);
    };  // struct Cr2
    using cr2_t = Reg<uint32_t, Cr2>;
          cr2_t   cr2;
#elif defined(STM32F103XB_GEN_TIM_2_3_4)
    struct Cr2 {
        using            pos_t = Pos<uint32_t, Cr2>;
        static constexpr pos_t      CCDS_POS = pos_t(3),
                                    MMS_POS  = pos_t(4),
                                    TI1S_POS = pos_t(7);

        using            bits_t = Bits<uint32_t, Cr2>;
        static constexpr bits_t     CCDS = bits_t(1, CCDS_POS),
                                    TI1S = bits_t(1, TI1S_POS);

        static const uint32_t       MMS_MASK = 0x7;

        using mskd_t = Mskd<uint32_t, Cr2>;
        static constexpr mskd_t MMS_RESET   = mskd_t(MMS_MASK, 0b000, MMS_POS),
                                MMS_ENABLE  = mskd_t(MMS_MASK, 0b001, MMS_POS),
                                MMS_UPDATE  = mskd_t(MMS_MASK, 0b010, MMS_POS),
                                MMS_COMPARE = mskd_t(MMS_MASK, 0b011, MMS_POS),
                                MMS_OC1REF  = mskd_t(MMS_MASK, 0b100, MMS_POS),
                                MMS_OC2REF  = mskd_t(MMS_MASK, 0b101, MMS_POS),
                                MMS_OC3REF  = mskd_t(MMS_MASK, 0b110, MMS_POS),
                                MMS_OC4REF  = mskd_t(MMS_MASK, 0b111, MMS_POS);
    };  // struct Cr2
    using cr2_t = Reg<uint32_t, Cr2>;
          cr2_t   cr2;
#else
    private: uint32_t   _unimplemented_cr2;  public:
#endif


    struct Smcr {
        using              pos_t = Pos<uint32_t, Smcr>;
        static constexpr   pos_t
                 SMS_POS = pos_t( 0),
                  TS_POS = pos_t( 4),
                 MSM_POS = pos_t( 7),
                 ETF_POS = pos_t( 8),
                ETPS_POS = pos_t(12),
                 ECE_POS = pos_t(14),
                 ETP_POS = pos_t(15);

        using              bits_t = Bits<uint32_t, Smcr>;
        static constexpr   bits_t
        MSM              = bits_t(1,          MSM_POS),
        ECE              = bits_t(1,          ECE_POS),
        ETP              = bits_t(1,          ETP_POS);

        static const uint32_t
                SMS_MASK =   0x10007U,
                 TS_MASK =       0x7U,
                ETF_MASK =       0xFU,
               ETPS_MASK =       0x3U;

