trebisky/stm32f103/usb_baboon/papoon/stm32f103xb_tim.h
        using              mskd_t = Mskd<uint32_t, Smcr>;
        static constexpr   mskd_t
        SMS_SLV_DIS      = mskd_t(        SMS_MASK,  0x00000,       SMS_POS),
        SMS_ENC_1        = mskd_t(        SMS_MASK,  0x00001,       SMS_POS),
        SMS_ENC_2        = mskd_t(        SMS_MASK,  0x00002,       SMS_POS),
        SMS_ENC_3        = mskd_t(        SMS_MASK,  0x00003,       SMS_POS),
        SMS_RESET        = mskd_t(        SMS_MASK,  0x00004,       SMS_POS),
        SMS_GATED        = mskd_t(        SMS_MASK,  0x00005,       SMS_POS),
        SMS_TRIGGER      = mskd_t(        SMS_MASK,  0x00006,       SMS_POS),
        SMS_EXT_1        = mskd_t(        SMS_MASK,  0x00007,       SMS_POS),
        SMS_RST_TRIG     = mskd_t(        SMS_MASK,  0x10000,       SMS_POS),
        TS_INT_0         = mskd_t(         TS_MASK,  0xb000,         TS_POS),
        TS_INT_1         = mskd_t(         TS_MASK,  0xb001,         TS_POS),
        TS_INT_2         = mskd_t(         TS_MASK,  0xb010,         TS_POS),
        TS_INT_3         = mskd_t(         TS_MASK,  0xb011,         TS_POS),
        TS_TI1_EDGE      = mskd_t(         TS_MASK,  0xb100,         TS_POS),
        TS_FILT_1        = mskd_t(         TS_MASK,  0xb101,         TS_POS),
        TS_FILT_2        = mskd_t(         TS_MASK,  0xb110,         TS_POS),
        TS_EXT           = mskd_t(         TS_MASK,  0xb111,         TS_POS),
        ETF_0_NONE       = mskd_t(        ETF_MASK,  0b0000,        ETF_POS),
        ETF_0_INT_N2     = mskd_t(        ETF_MASK,  0b0001,        ETF_POS),
        ETF_0_INT_N4     = mskd_t(        ETF_MASK,  0b0010,        ETF_POS),
        ETF_0_INT_N8     = mskd_t(        ETF_MASK,  0b0011,        ETF_POS),
        ETF_0_DTS_2_N6   = mskd_t(        ETF_MASK,  0b0100,        ETF_POS),
        ETF_0_DTS_2_N8   = mskd_t(        ETF_MASK,  0b0101,        ETF_POS),
        ETF_0_DTS_4_N6   = mskd_t(        ETF_MASK,  0b0110,        ETF_POS),
        ETF_0_DTS_4_N8   = mskd_t(        ETF_MASK,  0b0111,        ETF_POS),
        ETF_0_DTS_8_N6   = mskd_t(        ETF_MASK,  0b1000,        ETF_POS),
        ETF_0_DTS_8_N8   = mskd_t(        ETF_MASK,  0b1001,        ETF_POS),
        ETF_0_DTS_16_N5  = mskd_t(        ETF_MASK,  0b1010,        ETF_POS),
        ETF_0_DTS_16_N6  = mskd_t(        ETF_MASK,  0b1011,        ETF_POS),
        ETF_0_DTS_16_N8  = mskd_t(        ETF_MASK,  0b1100,        ETF_POS),
        ETF_0_DTS_32_N5  = mskd_t(        ETF_MASK,  0b1101,        ETF_POS),
        ETF_0_DTS_32_N6  = mskd_t(        ETF_MASK,  0b1110,        ETF_POS),
        ETF_0_DTS_32_N8  = mskd_t(        ETF_MASK,  0b1111,        ETF_POS),
        ETPS_PRESC_OFF   = mskd_t(       ETPS_MASK,  0b00,         ETPS_POS),
        ETPS_ETRP_DIV_2  = mskd_t(       ETPS_MASK,  0b01,         ETPS_POS),
        ETPS_ETRP_DIV_4  = mskd_t(       ETPS_MASK,  0b10,         ETPS_POS),
        ETPS_ETRP_DIV_8  = mskd_t(       ETPS_MASK,  0b11,         ETPS_POS);
    };  // struct Smcr
    using smcr_t = Reg<uint32_t, Smcr>;
          smcr_t   smcr;


    struct Dier {
        using              pos_t = Pos<uint32_t, Dier>;
        static constexpr   pos_t
                 UIE_POS = pos_t( 0),
               CC1IE_POS = pos_t( 1),
               CC2IE_POS = pos_t( 2),
               CC3IE_POS = pos_t( 3),
               CC4IE_POS = pos_t( 4),
               COMIE_POS = pos_t( 5),
                 TIE_POS = pos_t( 6),
                 BIE_POS = pos_t( 7),
                 UDE_POS = pos_t( 8),
               CC1DE_POS = pos_t( 9),
               CC2DE_POS = pos_t(10),
               CC3DE_POS = pos_t(11),
               CC4DE_POS = pos_t(12),
               COMDE_POS = pos_t(13),
                 TDE_POS = pos_t(14);

        using              bits_t = Bits<uint32_t, Dier>;
        static constexpr   bits_t
        UIE              = bits_t(1,          UIE_POS),
        CC1IE            = bits_t(1,        CC1IE_POS),
        CC2IE            = bits_t(1,        CC2IE_POS),
        CC3IE            = bits_t(1,        CC3IE_POS),
        CC4IE            = bits_t(1,        CC4IE_POS),
        COMIE            = bits_t(1,        COMIE_POS),
        TIE              = bits_t(1,          TIE_POS),
        BIE              = bits_t(1,          BIE_POS),
        UDE              = bits_t(1,          UDE_POS),
        CC1DE            = bits_t(1,        CC1DE_POS),
        CC2DE            = bits_t(1,        CC2DE_POS),
        CC3DE            = bits_t(1,        CC3DE_POS),
        CC4DE            = bits_t(1,        CC4DE_POS),
        COMDE            = bits_t(1,        COMDE_POS),
        TDE              = bits_t(1,          TDE_POS);
    };  // struct Dier
    using dier_t = Reg<uint32_t, Dier>;
          dier_t   dier;


    struct Sr {
        using              pos_t = Pos<uint32_t, Sr>;
        static constexpr   pos_t
                 UIF_POS = pos_t( 0),
               CC1IF_POS = pos_t( 1),
               CC2IF_POS = pos_t( 2),
               CC3IF_POS = pos_t( 3),
               CC4IF_POS = pos_t( 4),
               COMIF_POS = pos_t( 5),
                 TIF_POS = pos_t( 6),
                 BIF_POS = pos_t( 7),
                B2IF_POS = pos_t( 8),
               CC1OF_POS = pos_t( 9),
               CC2OF_POS = pos_t(10),
               CC3OF_POS = pos_t(11),
               CC4OF_POS = pos_t(12),
                SBIF_POS = pos_t(13),
               CC5IF_POS = pos_t(16),
               CC6IF_POS = pos_t(17);

        using              bits_t = Bits<uint32_t, Sr>;
        static constexpr   bits_t
        UIF              = bits_t(1,          UIF_POS),
        CC1IF            = bits_t(1,        CC1IF_POS),
        CC2IF            = bits_t(1,        CC2IF_POS),
        CC3IF            = bits_t(1,        CC3IF_POS),
        CC4IF            = bits_t(1,        CC4IF_POS),
        COMIF            = bits_t(1,        COMIF_POS),
        TIF              = bits_t(1,          TIF_POS),
        BIF              = bits_t(1,          BIF_POS),
        B2IF             = bits_t(1,         B2IF_POS),
        CC1OF            = bits_t(1,        CC1OF_POS),
        CC2OF            = bits_t(1,        CC2OF_POS),
        CC3OF            = bits_t(1,        CC3OF_POS),
        CC4OF            = bits_t(1,        CC4OF_POS),
        SBIF             = bits_t(1,         SBIF_POS),
        CC5IF            = bits_t(1,        CC5IF_POS),
        CC6IF            = bits_t(1,        CC6IF_POS);
    };  // struct Sr
    using sr_t = Reg<uint32_t, Sr>;
          sr_t   sr;


