trebisky/stm32f103/usb_baboon/papoon/stm32f103xb_tim.h
    struct Egr {
        using              pos_t = Pos<uint32_t, Egr>;
        static constexpr   pos_t
                  UG_POS = pos_t( 0),
                CC1G_POS = pos_t( 1),
                CC2G_POS = pos_t( 2),
                CC3G_POS = pos_t( 3),
                CC4G_POS = pos_t( 4)
#ifdef STM32F103XB_ADV_TIM_1
                                    ,
                COMG_POS = pos_t( 5)
#endif
                                    ,
                  TG_POS = pos_t( 6)
#ifdef STM32F103XB_ADV_TIM_1
                                    ,
                  BG_POS = pos_t( 7)
#endif
                                    ;

        using              bits_t = Bits<uint32_t, Egr>;
        static constexpr   bits_t
        UG               = bits_t(1,           UG_POS),
        CC1G             = bits_t(1,         CC1G_POS),
        CC2G             = bits_t(1,         CC2G_POS),
        CC3G             = bits_t(1,         CC3G_POS),
        CC4G             = bits_t(1,         CC4G_POS)
#ifdef STM32F103XB_ADV_TIM_1
                                                      ,
        COMG             = bits_t(1,         COMG_POS)
#endif
                                                      ,
        TG               = bits_t(1,           TG_POS)
#ifdef STM32F103XB_ADV_TIM_1
                                                      ,
        BG               = bits_t(1,           BG_POS)
#endif
                                                      ;
    };  // struct Egr
    using egr_t = Reg<uint32_t, Egr>;
          egr_t   egr;


    struct Ccmr1 {
        using              pos_t = Pos<uint32_t, Ccmr1>;
        static constexpr   pos_t
        // output/compare mode
                CC1S_POS = pos_t( 0),
               OC1FE_POS = pos_t( 2),
               OC1PE_POS = pos_t( 3),
                OC1M_POS = pos_t( 4),
               OC1CE_POS = pos_t( 7),
                CC2S_POS = pos_t( 8),
               OC2FE_POS = pos_t(10),
               OC2PE_POS = pos_t(11),
                OC2M_POS = pos_t(12),
               OC2CE_POS = pos_t(15),
        // input/capture mode
              IC1PSC_POS = pos_t( 2),
                IC1F_POS = pos_t( 4),
              IC2PSC_POS = pos_t(10),
                IC2F_POS = pos_t(12);

        using              bits_t = Bits<uint32_t, Ccmr1>;
        static constexpr   bits_t
        // output/compare mode
        OC1FE            = bits_t(1,        OC1FE_POS),
        OC1PE            = bits_t(1,        OC1PE_POS),
        OC1CE            = bits_t(1,        OC1CE_POS),
        OC2FE            = bits_t(1,        OC2FE_POS),
        OC2PE            = bits_t(1,        OC2PE_POS),
        OC2CE            = bits_t(1,        OC2CE_POS);

        static const uint32_t
        // output/compare mode
               CC1S_MASK =       0x3U,
               OC1M_MASK =    0x1007U,
               CC2S_MASK =       0x3U,
               OC2M_MASK =    0x1007U,
        // input/capture mode
             IC1PSC_MASK =       0x3U,
               IC1F_MASK =       0xFU,
             IC2PSC_MASK =       0x3U,
               IC2F_MASK =       0xFU;

        using              mskd_t = Mskd<uint32_t, Ccmr1>;
        static constexpr   mskd_t
        // both modes
        CC1S_OUTPUT      = mskd_t(       CC1S_MASK,  0b00,         CC1S_POS),
        CC1S_IC1_TI1     = mskd_t(       CC1S_MASK,  0b01,         CC1S_POS),
        CC1S_IC1_TI2     = mskd_t(       CC1S_MASK,  0b10,         CC1S_POS),
        CC1S_IC1_TRC     = mskd_t(       CC1S_MASK,  0b11,         CC1S_POS),
        // output/compare mode
        OC1M_FROZEN      = mskd_t(       OC1M_MASK,  0x0000,          OC1M_POS),
        OC1M_CH1_ACTV    = mskd_t(       OC1M_MASK,  0x0001,          OC1M_POS),
        OC1M_CH1_INACT   = mskd_t(       OC1M_MASK,  0x0002,          OC1M_POS),
        OC1M_TOGGLE      = mskd_t(       OC1M_MASK,  0x0003,          OC1M_POS),
        OC1M_FORCE_LOW   = mskd_t(       OC1M_MASK,  0x0004,          OC1M_POS),
        OC1M_FORCE_HIGH  = mskd_t(       OC1M_MASK,  0x0006,          OC1M_POS),
        OC1M_PWM_MODE_2  = mskd_t(       OC1M_MASK,  0x0007,          OC1M_POS),
        OC1M_RETRIG_1    = mskd_t(       OC1M_MASK,  0x1000,          OC1M_POS),
        OC1M_RETRIG_2    = mskd_t(       OC1M_MASK,  0x1001,          OC1M_POS),
        OC1M_COMB_PWM_1  = mskd_t(       OC1M_MASK,  0x1004,          OC1M_POS),
        OC1M_COMB_PWM_2  = mskd_t(       OC1M_MASK,  0x1005,          OC1M_POS),
        OC1M_ASYM_PWM_1  = mskd_t(       OC1M_MASK,  0x1006,          OC1M_POS),
        OC1M_ASYM_PWM_2  = mskd_t(       OC1M_MASK,  0x1007,          OC1M_POS),
        // both modes
        CC2S_OUT         = mskd_t(       CC2S_MASK,  0b00,             CC2S_POS),
        CC2S_IN_IC2_TI2  = mskd_t(       CC2S_MASK,  0b01,             CC2S_POS),
        CC2S_IN_IC2_TI1  = mskd_t(       CC2S_MASK,  0b10,             CC2S_POS),
        CC2S_IN_IC2_TRC  = mskd_t(       CC2S_MASK,  0b11,             CC2S_POS),
        // input/capture mode
        IC1PSC_PRESCAL_1 = mskd_t(     IC1PSC_MASK,  0b00,           IC1PSC_POS),
        IC1PSC_PRESCAL_2 = mskd_t(     IC1PSC_MASK,  0b01,           IC1PSC_POS),
        IC1PSC_PRESCAL_4 = mskd_t(     IC1PSC_MASK,  0b10,           IC1PSC_POS),
        IC1PSC_PRESCAL_8 = mskd_t(     IC1PSC_MASK,  0b11,           IC1PSC_POS),
        IC1F_NO_FILT     = mskd_t(       IC1F_MASK,  0b0000,           IC1F_POS),
        IC1F_CK_INT_N_2  = mskd_t(       IC1F_MASK,  0b0001,           IC1F_POS),
        IC1F_CK_INT_N_4  = mskd_t(       IC1F_MASK,  0b0010,           IC1F_POS),
        IC1F_CK_INT_N_8  = mskd_t(       IC1F_MASK,  0b0011,           IC1F_POS),
        IC1F_DTS_2_N_6   = mskd_t(       IC1F_MASK,  0b0100,           IC1F_POS),
        IC1F_DTS_2_N_8   = mskd_t(       IC1F_MASK,  0b0101,           IC1F_POS),
        IC1F_DTS_4_N_6   = mskd_t(       IC1F_MASK,  0b0110,           IC1F_POS),
        IC1F_DTS_4_N_8   = mskd_t(       IC1F_MASK,  0b0111,           IC1F_POS),
        IC1F_DTS_8_N_6   = mskd_t(       IC1F_MASK,  0b1000,           IC1F_POS),
        IC1F_DTS_8_N_8   = mskd_t(       IC1F_MASK,  0b1001,           IC1F_POS),
        IC1F_DTS_16_N_5  = mskd_t(       IC1F_MASK,  0b1010,           IC1F_POS),
        IC1F_DTS_16_N_6  = mskd_t(       IC1F_MASK,  0b1011,           IC1F_POS),
        IC1F_DTS_16_N_8  = mskd_t(       IC1F_MASK,  0b1100,           IC1F_POS),
        IC1F_DTS_32_N_5  = mskd_t(       IC1F_MASK,  0b1101,           IC1F_POS),
        IC1F_DTS_32_N_6  = mskd_t(       IC1F_MASK,  0b1110,           IC1F_POS),
        IC1F_DTS_32_N_8  = mskd_t(       IC1F_MASK,  0b1111,           IC1F_POS),
        IC2PSC_PRESCAL_1 = mskd_t(     IC2PSC_MASK,  0b00,           IC2PSC_POS),
        IC2PSC_PRESCAL_2 = mskd_t(     IC2PSC_MASK,  0b01,           IC2PSC_POS),
        IC2PSC_PRESCAL_4 = mskd_t(     IC2PSC_MASK,  0b10,           IC2PSC_POS),
        IC2PSC_PRESCAL_8 = mskd_t(     IC2PSC_MASK,  0b11,           IC2PSC_POS);
    };  // struct Ccmr1
    using ccmr1_t = Reg<uint32_t, Ccmr1>;
          ccmr1_t   ccmr1;


    struct Ccmr2 {
        using              pos_t = Pos<uint32_t, Ccmr2>;
        static constexpr   pos_t
        // output/compare mode
                CC3S_POS = pos_t( 0),
               OC3FE_POS = pos_t( 2),
               OC3PE_POS = pos_t( 3),
                OC3M_POS = pos_t( 4),
               OC3CE_POS = pos_t( 7),
                CC4S_POS = pos_t( 8),
               OC4FE_POS = pos_t(10),
               OC4PE_POS = pos_t(11),
                OC4M_POS = pos_t(12),
               OC4CE_POS = pos_t(15),
        // input/capture mode
              IC3PSC_POS = pos_t( 2),
                IC3F_POS = pos_t( 4),
              IC4PSC_POS = pos_t(10),
                IC4F_POS = pos_t(12);

        using              bits_t = Bits<uint32_t, Ccmr2>;
        static constexpr   bits_t
        // output/compare mode
        OC3FE            = bits_t(1,        OC3FE_POS),
        OC3PE            = bits_t(1,        OC3PE_POS),
        OC3CE            = bits_t(1,        OC3CE_POS),
        OC4FE            = bits_t(1,        OC4FE_POS),
        OC4PE            = bits_t(1,        OC4PE_POS),
        OC4CE            = bits_t(1,        OC4CE_POS);

        static const uint32_t
        // output/compare mode
               CC3S_MASK =       0x3U,
               OC3M_MASK =    0x1007U,
               CC4S_MASK =       0x3U,
               OC4M_MASK =    0x1007U,
        // input/capture mode
             IC3PSC_MASK =       0x3U,
               IC3F_MASK =       0xFU,
             IC4PSC_MASK =       0x3U,
               IC4F_MASK =       0xFU;

