trebisky/stm32f103/usb_baboon/papoon/stm32f103xb_tim.h
        using              mskd_t = Mskd<uint32_t, Ccmr2>;
        static constexpr   mskd_t
        // both modes
        CC3S_OUTPUT      = mskd_t(       CC3S_MASK,  0b00,         CC3S_POS),
        CC3S_IC3_TI1     = mskd_t(       CC3S_MASK,  0b01,         CC3S_POS),
        CC3S_IC3_TI2     = mskd_t(       CC3S_MASK,  0b10,         CC3S_POS),
        CC3S_IC3_TRC     = mskd_t(       CC3S_MASK,  0b11,         CC3S_POS),
        // output/compare mode
        OC3M_FROZEN      = mskd_t(       OC3M_MASK,  0x0000,          OC3M_POS),
        OC3M_CH1_ACTV    = mskd_t(       OC3M_MASK,  0x0001,          OC3M_POS),
        OC3M_CH1_INACT   = mskd_t(       OC3M_MASK,  0x0002,          OC3M_POS),
        OC3M_TOGGLE      = mskd_t(       OC3M_MASK,  0x0003,          OC3M_POS),
        OC3M_FORCE_LOW   = mskd_t(       OC3M_MASK,  0x0004,          OC3M_POS),
        OC3M_FORCE_HIGH  = mskd_t(       OC3M_MASK,  0x0006,          OC3M_POS),
        OC3M_PWM_MODE_2  = mskd_t(       OC3M_MASK,  0x0007,          OC3M_POS),
        OC3M_RETRIG_1    = mskd_t(       OC3M_MASK,  0x1000,          OC3M_POS),
        OC3M_RETRIG_2    = mskd_t(       OC3M_MASK,  0x1001,          OC3M_POS),
        OC3M_COMB_PWM_1  = mskd_t(       OC3M_MASK,  0x1004,          OC3M_POS),
        OC3M_COMB_PWM_2  = mskd_t(       OC3M_MASK,  0x1005,          OC3M_POS),
        OC3M_ASYM_PWM_1  = mskd_t(       OC3M_MASK,  0x1006,          OC3M_POS),
        OC3M_ASYM_PWM_2  = mskd_t(       OC3M_MASK,  0x1007,          OC3M_POS),
        // both modes
        CC4S_OUT         = mskd_t(       CC4S_MASK,  0b00,             CC4S_POS),
        CC4S_IN_IC4_TI2  = mskd_t(       CC4S_MASK,  0b01,             CC4S_POS),
        CC4S_IN_IC4_TI1  = mskd_t(       CC4S_MASK,  0b10,             CC4S_POS),
        CC4S_IN_IC4_TRC  = mskd_t(       CC4S_MASK,  0b11,             CC4S_POS),
        // input/capture mode
        IC3PSC_PRESCAL_1 = mskd_t(     IC3PSC_MASK,  0b00,           IC3PSC_POS),
        IC3PSC_PRESCAL_2 = mskd_t(     IC3PSC_MASK,  0b01,           IC3PSC_POS),
        IC3PSC_PRESCAL_4 = mskd_t(     IC3PSC_MASK,  0b10,           IC3PSC_POS),
        IC3PSC_PRESCAL_8 = mskd_t(     IC3PSC_MASK,  0b11,           IC3PSC_POS),
        IC3F_NO_FILT     = mskd_t(       IC3F_MASK,  0b0000,           IC3F_POS),
        IC3F_CK_INT_N_2  = mskd_t(       IC3F_MASK,  0b0001,           IC3F_POS),
        IC3F_CK_INT_N_4  = mskd_t(       IC3F_MASK,  0b0010,           IC3F_POS),
        IC3F_CK_INT_N_8  = mskd_t(       IC3F_MASK,  0b0011,           IC3F_POS),
        IC3F_DTS_2_N_6   = mskd_t(       IC3F_MASK,  0b0100,           IC3F_POS),
        IC3F_DTS_2_N_8   = mskd_t(       IC3F_MASK,  0b0101,           IC3F_POS),
        IC3F_DTS_4_N_6   = mskd_t(       IC3F_MASK,  0b0110,           IC3F_POS),
        IC3F_DTS_4_N_8   = mskd_t(       IC3F_MASK,  0b0111,           IC3F_POS),
        IC3F_DTS_8_N_6   = mskd_t(       IC3F_MASK,  0b1000,           IC3F_POS),
        IC3F_DTS_8_N_8   = mskd_t(       IC3F_MASK,  0b1001,           IC3F_POS),
        IC3F_DTS_16_N_5  = mskd_t(       IC3F_MASK,  0b1010,           IC3F_POS),
        IC3F_DTS_16_N_6  = mskd_t(       IC3F_MASK,  0b1011,           IC3F_POS),
        IC3F_DTS_16_N_8  = mskd_t(       IC3F_MASK,  0b1100,           IC3F_POS),
        IC3F_DTS_32_N_5  = mskd_t(       IC3F_MASK,  0b1101,           IC3F_POS),
        IC3F_DTS_32_N_6  = mskd_t(       IC3F_MASK,  0b1110,           IC3F_POS),
        IC3F_DTS_32_N_8  = mskd_t(       IC3F_MASK,  0b1111,           IC3F_POS),
        IC4PSC_PRESCAL_1 = mskd_t(     IC4PSC_MASK,  0b00,           IC4PSC_POS),
        IC4PSC_PRESCAL_2 = mskd_t(     IC4PSC_MASK,  0b01,           IC4PSC_POS),
        IC4PSC_PRESCAL_4 = mskd_t(     IC4PSC_MASK,  0b10,           IC4PSC_POS),
        IC4PSC_PRESCAL_8 = mskd_t(     IC4PSC_MASK,  0b11,           IC4PSC_POS);
    };  // struct Ccmr2
    using ccmr2_t = Reg<uint32_t, Ccmr2>;
          ccmr2_t   ccmr2;


#ifdef STM32F103XB_ADV_TIM_1
    struct Ccer {
        using              pos_t = Pos<uint32_t, Ccer>;
        static constexpr   pos_t
                CC1E_POS = pos_t( 0),
                CC1P_POS = pos_t( 1),
               CC1NE_POS = pos_t( 2),
               CC1NP_POS = pos_t( 3),
                CC2E_POS = pos_t( 4),
                CC2P_POS = pos_t( 5),
               CC2NE_POS = pos_t( 6),
               CC2NP_POS = pos_t( 7),
                CC3E_POS = pos_t( 8),
                CC3P_POS = pos_t( 9),
               CC3NE_POS = pos_t(10),
               CC3NP_POS = pos_t(11),
                CC4E_POS = pos_t(12),
                CC4P_POS = pos_t(13);

        using              bits_t = Bits<uint32_t, Ccer>;
        static constexpr   bits_t
        CC1E             = bits_t(1,         CC1E_POS),
        CC1P             = bits_t(1,         CC1P_POS),
        CC1NE            = bits_t(1,        CC1NE_POS),
        CC1NP            = bits_t(1,        CC1NP_POS),
        CC2E             = bits_t(1,         CC2E_POS),
        CC2P             = bits_t(1,         CC2P_POS),
        CC2NE            = bits_t(1,        CC2NE_POS),
        CC2NP            = bits_t(1,        CC2NP_POS),
        CC3E             = bits_t(1,         CC3E_POS),
        CC3P             = bits_t(1,         CC3P_POS),
        CC3NE            = bits_t(1,        CC3NE_POS),
        CC3NP            = bits_t(1,        CC3NP_POS),
        CC4E             = bits_t(1,         CC4E_POS);
    };  // struct Ccer
    using ccer_t = Reg<uint32_t, Ccer>;
          ccer_t   ccer;
#elif defined(STM32F103XB_GEN_TIM_2_3_4)
    struct Ccer {
        using              pos_t = Pos<uint32_t, Ccer>;
        static constexpr   pos_t
                CC1E_POS = pos_t( 0),
                CC1P_POS = pos_t( 1),
                CC2E_POS = pos_t( 4),
                CC2P_POS = pos_t( 5),
                CC3E_POS = pos_t( 8),
                CC3P_POS = pos_t( 9),
                CC4E_POS = pos_t(12),
                CC4P_POS = pos_t(13);

        using              bits_t = Bits<uint32_t, Ccer>;
        static constexpr   bits_t
        CC1E             = bits_t(1,         CC1E_POS),
        CC1P             = bits_t(1,         CC1P_POS),
        CC2E             = bits_t(1,         CC2E_POS),
        CC2P             = bits_t(1,         CC2P_POS),
        CC3E             = bits_t(1,         CC3E_POS),
        CC3P             = bits_t(1,         CC3P_POS),
        CC4E             = bits_t(1,         CC4E_POS),
        CC4P             = bits_t(1,         CC4P_POS);
    };  // struct Ccer
    using ccer_t = Reg<uint32_t, Ccer>;
          ccer_t   ccer;
#else
    private: uint32_t   _unimplemented_ccer;     public:
#endif


