trebisky/stm32f103/usb_baboon/papoon/stm32f103xb_tim.h
                uint16_t    cnt;
    private:    uint16_t    _cnt_high_bits;  public:

                uint16_t    psc;
    private:    uint16_t    _psc_high_bits;  public:


                uint16_t    arr;
    private:    uint16_t    _arr_high_bits;  public:


#ifdef STM32F103XB_ADV_TIM_1
             uint8_t    rcr_rep;
    private:
             uint8_t    _unimplemented_rcr_high_byte ;
             uint16_t   _unimplemented_rcr_high_short;
#else
    private: uint32_t   _unimplemented_rcr; public:
#endif


                uint16_t    ccr1;
    private:    uint16_t    _ccr1_high_bits;     public:


                uint16_t    ccr2;
    private:    uint16_t    _ccr2_high_bits;     public:


                uint16_t    ccr3;
    private:    uint16_t    _ccr3_high_bits;     public:


                uint16_t    ccr4;
    private:    uint16_t    _ccr4_high_bits;     public:


#ifdef STM32F103XB_ADV_TIM_1
    struct Bdtr {
        using              pos_t = Pos<uint32_t, Bdtr>;
        static constexpr   pos_t
                 DTG_POS = pos_t( 0),
                LOCK_POS = pos_t( 8),
                OSSI_POS = pos_t(10),
                OSSR_POS = pos_t(11),
                 BKE_POS = pos_t(12),
                 BKP_POS = pos_t(13),
                 AOE_POS = pos_t(14),
                 MOE_POS = pos_t(15);

        using              bits_t = Bits<uint32_t, Bdtr>;
        static constexpr   bits_t
        OSSI             = bits_t(1,         OSSI_POS),
        OSSR             = bits_t(1,         OSSR_POS),
        BKE              = bits_t(1,          BKE_POS),
        BKP              = bits_t(1,          BKP_POS),
        AOE              = bits_t(1,          AOE_POS),
        MOE              = bits_t(1,          MOE_POS);

        static const uint32_t
                DTG_MASK =      0xFFU,
               LOCK_MASK =       0x3U;

        using              mskd_t = Mskd<uint32_t, Bdtr>;
        using              shft_t = Shft<uint32_t, Bdtr>;

        static constexpr   mskd_t
        LOCK_OFF         = mskd_t(       LOCK_MASK,  0b00,         LOCK_POS),
        LOCK_LEVEL_2     = mskd_t(       LOCK_MASK,  0b01,         LOCK_POS),
        LOCK_LEVEL_3     = mskd_t(       LOCK_MASK,  0b10,         LOCK_POS),
        LOCK_LEVEL_4     = mskd_t(       LOCK_MASK,  0b11,         LOCK_POS);

        /* note bits 7:5 control step size
          rm0410_f7_6,7_xxx_reference_manual.pdf
          25.4.18 TIM1/TIM8 break and dead-time register (TIMx_BDTR)
          Bits 7:0 DTG[7:0]: Dead-time generator setup
          This bit-field defines the duration of the dead-time inserted
            between the complementary outputs. DT correspond to this
            duration.
          DTG[7:5]=0xx => DT=DTG[7:0]x t dtg with t dtg =t DTS .
          DTG[7:5]=10x => DT=(64+DTG[5:0])xt dtg with T dtg =2xt DTS .
          DTG[7:5]=110 => DT=(32+DTG[4:0])xt dtg with T dtg =8xt DTS .
          DTG[7:5]=111 => DT=(32+DTG[4:0])xt dtg with T dtg =16xt DTS .
          Example if T DTS =125ns (8MHz), dead-time possible values are:
          0 to 15875 ns by 125 ns steps,
          16 us to 31750 ns by 250 ns steps,
          32 us to 63us by 1 us steps,
          64 us to 126 us by 2 us steps
          Note: This bit-field can not be modified as long as LOCK level 1,
                2 or 3 has been programmed (LOCK bits in TIMx_BDTR register).
        */
        REGBITS_MSKD_RANGE("Tim::Bdtr",
                           DTG,
                           dtg,
                           DTG_MASK,
                           DTG_POS,
                           DTG_MASK);
    };  // struct Bdtr
    using bdtr_t = Reg<uint32_t, Bdtr>;
          bdtr_t   bdtr;
#else
    private: uint32_t   _unimplemented_bdtr;     public:
#endif


    struct Dcr {
        using              pos_t = Pos<uint32_t, Dcr>;
        static constexpr   pos_t
                 DBA_POS = pos_t( 0),
                 DBL_POS = pos_t( 8);

        static const uint32_t
                DBA_MASK =      0x1FU,
                DBL_MASK =      0x1FU;

        using   mskd_t = Mskd<uint32_t, Dcr>;
        using   shft_t = Shft<uint32_t, Dcr>;

        REGBITS_MSKD_RANGE("Tim::Dcr",
                           DBA,
                           dba,
                           DBA_MASK,
                           DBA_POS,
                           DBA_MASK);
        REGBITS_MSKD_RANGE("Tim::Dcr",
                           DBL,
                           dbl,
                           DBL_MASK,
                           DBL_POS,
                           DBL_MASK);
    };  // struct Dcr
    using dcr_t = Reg<uint32_t, Dcr>;
          dcr_t   dcr;


#ifdef STM32F103XB_ADV_TIM1
                uint32_t    dmar_dmab;
#elif defined(STM32F103XB_GEN_TIM2_3_4)
                uint16_t    dmar_dmab;
    private:    uint16_t    _dmar_dmab_high_bits;    public:
#else
    private: uint32_t   _unimplemented_dmar; public:
#endif


    private: uint32_t   _unimplemented_or; public:


#endif  // #ifndef STM32F103XB_TIM_HXX_INCLUDE
